<script lang="ts">
</script>


<div class="m-4 pb-10 sm:m-8">
    <article class="prose lg:prose-lg ">
        <h2>자주 묻는 질문</h2>

        <h4>왜 공통 알림 채널만 미리보기를 할 수 있나요?</h4>
        <p>
            공개 채널만 미리보기가 가능하기 때문입니다. <br>
            계정당 공개로 설정할 수 있는 채널의 개수 제한이 작아서, 
            공통 알림 채널들만 공개 채널로 설정했고, 나머지 알림 채널들은 모두 비공개 채널입니다.
        </p>

        <h4>"너무 많이 시도하셨습니다. 나중에 다시 시도하세요"<br>라는 창이 나와서 채널에 들어갈 수 없어요.</h4>
        <p>
            일정 시간 동안 들어갈 수 있는 비공개 채널의 개수에 제한이 있기 때문입니다. <br>
            정확한 제한량은 공개되어 있지 않습니다. 직접 시도해 본 결과, 
            최초로 제한에 걸렸을 때는 약 5분만 대기해도 다시 새로운 채널에 들어갈 수 있게 되지만, 그 이후에는 30분 ~ 1시간 정도 대기해야 할 것으로 보입니다.
            <br>
            예시로, 15개의 비공개 채널을 들어가기 위해서는 다음과 같은 과정을 거쳐야 합니다.<br>
            <em>5개 채널 입장 → (5분 이상 대기) → 5개 채널 입장 → (20분 이상 대기) → 5개 채널 입장</em>
        </p>

        <h4>채팅 알림 채널에서 왜 트위치 이모티콘이 표시되지 않나요?</h4>
        <p>
            아직 텔레그램 봇은 커스텀 이모지를 전송할 수 없기 때문입니다. <br>
            텔레그램 봇 API가 커스텀 이모지 전송을 지원하기 전까지는, 
            단어 또는 기본 이모지 또는 이모티콘 이름으로 대체되어 표시됩니다.
        </p>


        <h2>팁</h2>
        <ul>
            <li>
                <p>방송 또는 토토 알림 채널의 각 메시지 제목에 있는 이모지를 클릭하면,
                    해당 트위치 채널로 이동할 수 있습니다.</p>
            </li>
            <li>
                <p>텔레그램의 폴더 기능을 활용하면, 알림 채널들만 따로 묶어서 정리할 수 있습니다.</p>
            </li>
        </ul>
    

        

    </article>

    
</div>

